########## General ##########

cask "firefox"
cask "google-chrome"
cask "slack"

########## Developer tools ##########

cask "iterm2"
brew "fish"
cask "sublime-text"
cask "docker"
cask "postman"

########## Javascript tools ##########

brew "node"
brew "yarn"

########## Java tools ##########

tap "adoptopenjdk/openjdk"

brew "jenv"
brew "maven"

cask "intellij-idea-ce"
cask "eclipse-ide"
cask "adoptopenjdk8"
cask "adoptopenjdk9"
cask "adoptopenjdk11"

########## Python tools ##########

brew "openssl@1.1" # Optional dependency for pyenv
brew "readline" # Optional dependency for pyenv
brew "pyenv"
